<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0a05dff8127fd86104c038b3d8bc26df0c6ab6eb2642bee03b670f3e0915b6c6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #702 at https://github.com/cal-itp/data-infra/actions/runs/17995366104","plan_out_hash":"4b0d4c0b988e15a6f88525e1d10639ee138f5ed902481b0938af6307ac5ef811","plan_hash":"bcb6d854e44434ef6de7d868ca984e63912ad6e4f8a29f6a01b1b0688db910a9","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "43kZvw==" -> (known after apply)
!~      detect_md5hash      = "sXCasmgYxuAxbDbnGQTTcw==" -> "different hash"
!~      generation          = 1758720908166632 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "sXCasmgYxuAxbDbnGQTTcw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "4D8RYQ==" -> (known after apply)
!~      detect_md5hash      = "Ks1q/FpyQkBidafAdghszw==" -> "different hash"
!~      generation          = 1758720909549541 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "Ks1q/FpyQkBidafAdghszw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #702](https://github.com/cal-itp/data-infra/actions/runs/17995366104)